Revit 2024 API
SpecTypeId.DemandFactor Property
 Demand Factor, in discipline Electrical.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId DemandFactor { get; }
Visual Basic
Public Shared ReadOnly Property DemandFactor As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ DemandFactor {
	ForgeTypeId^ get ();
}
See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace